src/Catalogs/Currencies.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>Currencies</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ImportFromInternet</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LongDescription</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Margin</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MainCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InWordParametersInHomeLanguage</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RateCalculationFormula</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RateSettingMethod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CurrencyRateSettingMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/CurrencyRateSettingMethods.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>CurrencyRateSettingMethods</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ImportFromInternet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ManualInput</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AnotherCurrencyMargin</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CalculateByFormula</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Currencies/Forms/PickCurrenciesFromClassifier/Ext/Form/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	// Skipping the initialization to guarantee that the form will be received if the Autotest parameter is passed.
	If Parameters.Property("Autotest") Then 
		Return;
	EndIf;
	
	// Filling in the currency list from the currency classifier
	CloseOnChoice = False;
	FillCurrencyTable();
	
EndProcedure

#EndRegion

#Region ItemEventHandlersFormTableCurrencyList

&AtClient
Procedure CurrencyListChoice(Item, SelectedRow, Field, StandardProcessing)
	
	ProcessChoiceInCurrencyList(StandardProcessing);
	
EndProcedure

#EndRegion

#Region FormCommandHandlers

&AtClient
Procedure ChooseExecute()
	
	ProcessChoiceInCurrencyList();
	
EndProcedure

#EndRegion

#Region InternalProceduresAndFunctions

&AtServer
Procedure FillCurrencyTable()
	
	// Filling in the currency list from the currency classifier template
	
	XMLClassifier = Catalogs.Currencies.GetTemplate("CurrencyClassifier").GetText();
	
	ClassifierTable = CommonUse.ReadXMLToTable(XMLClassifier).Data;
	
	For Each CCRecord In ClassifierTable Do
		NewRow = Currencies.Add();
		NewRow.NumericCurrencyCode            = CCRecord.Code;
		NewRow.AlphabeticCurrencyCode         = CCRecord.CodeSymbol;
		NewRow.Description                    = CCRecord.Name;
		NewRow.CountriesAndTerritories        = CCRecord.Description;
		NewRow.Importing                      = CCRecord.RBCLoading;
		NewRow.InWordParametersInHomeLanguage = CCRecord.NumerationItemOptions;
	EndDo;
	
EndProcedure

&AtServer
Function SaveSelectedRows(Val SelectedRows, ThereAreRates)
	
	ThereAreRates = False;
	CurrentRef = Undefined;
	
	For Each LineNumber In SelectedRows Do
		CurrentData = Currencies[LineNumber];
		
		RowInDatabase = Catalogs.Currencies.FindByCode(CurrentData.NumericCurrencyCode);
		If ValueIsFilled(RowInDatabase) Then
			If LineNumber = Items.CurrencyList.CurrentRow Or CurrentRef = Undefined Then
				CurrentRef = RowInDatabase;
			EndIf;
			Continue;
		EndIf;
		
		NewRow = Catalogs.Currencies.CreateItem();
		NewRow.Code            = CurrentData.NumericCurrencyCode;
		NewRow.Description     = CurrentData.AlphabeticCurrencyCode;
		NewRow.LongDescription = CurrentData.Description;
		If CurrentData.Importing Then
			NewRow.RateSettingMethod = Enums.CurrencyRateSettingMethods.ImportFromInternet;
		Else
			NewRow.RateSettingMethod = Enums.CurrencyRateSettingMethods.ManualInput;
		EndIf;
		NewRow.InWordParametersInHomeLanguage = CurrentData.InWordParametersInHomeLanguage;
		NewRow.Write();
		
		If LineNumber = Items.CurrencyList.CurrentRow Or CurrentRef = Undefined Then
			CurrentRef = NewRow.Ref;
		EndIf;
		
		If CurrentData.Importing Then 
			ThereAreRates = True;
		EndIf;
		
	EndDo;
	
	Return CurrentRef;

EndFunction

&AtClient
Procedure ProcessChoiceInCurrencyList(StandardProcessing = Undefined)
	Var ThereAreRates;
	
	// Adds a catalog item and displays it to the user
	StandardProcessing = False;
	
	CurrentRef = SaveSelectedRows(Items.CurrencyList.SelectedRows, ThereAreRates);
	
	NotifyChoice(CurrentRef);
	
	ShowUserNotification(
		NStr("en = 'Currencies are added.'"), ,
		?(StandardSubsystemsClientCached.ClientParameters().DataSeparationEnabled And ThereAreRates, 
			NStr("en = 'The rates will soon be imported automatically.'"), ""),
		PictureLib.Information32);
	Close();
	
EndProcedure

#EndRegion
